import { Collapse } from "antd";
import Text from "components/utils/text";
import { QuestionStyle } from "./style";

const { Panel } = Collapse;

export default function CoQuestions() {
    return (
        <QuestionStyle>
            <Text as="h1" align="center">الأسئلة الأكثر تكرارا</Text>
            <Collapse bordered={false} defaultActiveKey={['1']}>
                <Panel header="ما هي التجارة الإلكترونية؟" key="1">
                    التجارة الإلكترونية هي نوع من التجارة تتم عبر الإنترنت في بيئة رقمية. موقع التجارة الإلكترونية هو متجر على الإنترنت حيث يمكن بيع وشراء المنتجات والخدمات عبر الإنترنت. تقدم لك Shoppy e-commerce موقعًا احترافيًا للتجارة الإلكترونية يساعدك في إعداد أعمال التجارة الإلكترونية بسرعة ونجاح.
                </Panel>
                <Panel header="ما هي أفضل منصة لإنشاء موقع للتجارة الإلكترونية؟" key="2">
                    هناك بعض العوامل التي يجب مراعاتها من أجل إنشاء موقع تجارة إلكترونية رائع لعملك. عند إنشاء موقع ويب احترافي ، ضع في اعتبارك ميزات التجارة الإلكترونية التي تحتاجها لبدء البيع عبر الإنترنت ، مثل واجهة متجر جميلة ومدفوعات آمنة عبر الإنترنت والمزيد. بعد ذلك ، ضع في اعتبارك التسعير. تقدم معظم المنصات أسعارًا تنافسية لموقع التجارة الإلكترونية. لذا اختر أفضل سعر لنشاطك التجاري لبدء البيع عبر الإنترنت.
                </Panel>
                <Panel header="أين يمكنني إنشاء موقع للتجارة الإلكترونية؟" key="3">
                    من خلال بناء عملك عبر الإنترنت باستخدام Shoppy ، يمكنك العثور على كل ما تحتاجه لإنشاء موقع تجارة إلكترونية ناجح في مكان واحد ، بدءًا من تصميم موقع ويب مدروس جيدًا إلى جميع ميزات التجارة الإلكترونية التي يجب توفرها.
                </Panel>
                <Panel header="ما هي المنتجات التي يجب علي بيعها عبر الإنترنت؟" key="4">
                    يمكنك بيع أي شيء تقريبًا عبر الإنترنت هذه الأيام. من الأعمال الفنية الخاصة بك إلى طعام الحيوانات الأليفة ، والكتب الإلكترونية إلى القمصان ، وألعاب الطاولة إلى الطعام ، واشتراكات صالونات التجميل إلى مستحضرات التجميل ، والأشياء التي يمكنك بيعها لا حصر لها حقًا. يجب أن يعتمد المنتج الذي تختاره لموقع التجارة الإلكترونية الخاص بك على طلب السوق والجمهور المستهدف واتجاهات التجارة الإلكترونية.
                </Panel>
                <Panel header="ما هي أفضل الطرق للبيع عبر الإنترنت؟" key="5">
                    هناك طرق عديدة للبيع بنجاح عبر الإنترنت. الأول بسيط للغاية: بيع منتجاتك عبر الإنترنت على موقع للتجارة الإلكترونية. بدلاً من ذلك ، يمكنك استخدام خدمة الطباعة عند الطلب لإنشاء منتجات أصلية تعرض فنك وعلامتك التجارية. مع دروبشيبينغ ، المعروف باسم التجارة الإلكترونية بدون مخزون ، يمكنك تقديم ملايين المنتجات عالية الجودة في متجرك دون متاعب إدارة المخزون أو الإيفاء أو الشحن.

                    مع نمو أعمال التجارة الإلكترونية الخاصة بك ، قم بتوسيع عملياتك عن طريق بيع قنوات متعددة على Facebook و eBay والمزيد.
                </Panel>
                <Panel header="هل يمكنني فتح موقع للتجارة الإلكترونية بدون مخزون خاص بي؟" key="6">
                    يمكنك بسهولة إنشاء موقع للتجارة الإلكترونية دون القلق بشأن المخزون أو التكاليف الأولية.

                    يتيح لك Dropshipping الحصول على منتجات غير محدودة وبيعها من موقع التجارة الإلكترونية. قم بإنشاء موقع للتجارة الإلكترونية وحدد المنتجات التي تريد بيعها من سوق دروبشيبينغ مثل Modalyst. عندما يشتري أحد العملاء منتجًا ، يتم إعادة توجيه الطلب تلقائيًا إلى الموردين الخاصين بك ويقومون بالشحن والتسليم نيابة عنك. مع الطباعة حسب الطلب ، يمكنك تخصيص مئات المنتجات برسوماتك وتصميماتك الفريدة. عند وصول أمر ما ، يقوم المورد الخاص بك بطباعة الطلب وشحنه مباشرة إلى عميلك. خيار آخر هو بيع المنتجات الرقمية مثل الكتب الإلكترونية أو الموسيقى أو الصور المخزنة.
                </Panel>
                <Panel header="ما هي أفضل الأعمال التجارية الإلكترونية للدخول في عام 2021؟" key="7">
                    لقد أثر عام 2020 بشكل كبير على اتجاهات التجارة الإلكترونية العالمية. لذا فإن العمل الذي تختار الدخول إليه يعتمد على العرض والطلب اليوم. تتزايد الأعمال التجارية عبر الإنترنت على الرغم من أن COVID-19 يشكل بعض التحديات الخطيرة. تقوم المتاجر التي تنقل أعمالها عبر الإنترنت بإنشاء نموذج أعمال أكثر تقدمًا. تعرف على أكثر فئات المنتجات مبيعًا في عام 2020.
                </Panel>
                <Panel header="هل يمكنني كسب لقمة العيش من خلال البيع عبر الإنترنت؟" key="8">
                    نعم ، يمكنك بالتأكيد! يعتمد مجتمعنا العالمي الذي يضم أكثر من 500000 من بائعي Shoppy على متجرهم عبر الإنترنت يوميًا لكسب لقمة العيش. تحقق من بعض أفضل البائعين لدينا واحصل على مصدر إلهام لبدء البيع عبر الإنترنت.
                </Panel>
                <Panel header="ما هو أكثر أنواع الأعمال التجارية عبر الإنترنت ربحية؟" key="9">
                    تزداد التجارة الإلكترونية قوة يومًا بعد يوم. لديك بالتأكيد القدرة على الحصول على عمل تجاري مربح عبر الإنترنت. تعرف على أكثر 10 فئات للمنتجات شيوعًا.
                </Panel>
                <Panel header="كيف تفتح متجرًا على الإنترنت؟" key="10">
                    لفتح متجر إلكتروني ناجح ، فكر في العلامة التجارية التي تريد إنشاءها والجمهور المستهدف. ثم أنشئ موقعًا للتجارة الإلكترونية وصمم متجرك ليلائم علامتك التجارية. من خلال اختيار مجموعة منتجاتك بعناية وتسويقها بشكل صحيح ، يمكنك الحصول على متجر ناجح عبر الإنترنت في أي وقت من الأوقات. لمزيد من المعلومات ، اقرأ دليلنا التفصيلي حول كيفية فتح متجر ناجح عبر الإنترنت.                </Panel>
                <Panel header="ما هي الخدمات عبر الإنترنت المطلوبة الآن؟" key="11">
                    اليوم ، تهدف الشركات إلى الوصول إلى عملائها في أي مكان وزمان. وقد أدى ذلك إلى الانتقال من الخدمات المباشرة وجهًا لوجه إلى الخدمات عبر الإنترنت الأكثر ملاءمة وراحة. هناك العديد من الخدمات المطلوبة عبر الإنترنت في الوقت الحالي ، من دروس اللياقة البدنية الافتراضية إلى جلسات العلاج عبر الإنترنت ودروس الطهي والمزيد.
                </Panel>
                <Panel header="كيف يمكنني الحصول على موقع تجارة إلكترونية مجاني؟" key="12">
                    تقدم بعض منصات مواقع التجارة الإلكترونية فترة تجريبية مجانية محدودة. ومع ذلك ، للبيع عبر الإنترنت والحصول على أموال على معظم الأنظمة الأساسية ، ستحتاج إلى شراء خطة اشتراك تختلف من منصة إلى أخرى.
                </Panel>
                <Panel header="كم يكلف متجر على الإنترنت؟" key="13">
                    تعتمد تكلفة إنشاء وإدارة موقع التجارة الإلكترونية والمتجر عبر الإنترنت على عدة عوامل ، مثل منشئ متجرك عبر الإنترنت ، وميزات التجارة الإلكترونية التي تحتاجها للبيع عبر الإنترنت ، وأدوات التسويق الإضافية.
                    باستخدام Shoppy ، يمكنك إعداد موقع التجارة الإلكترونية الخاص بك مجانًا بدون أي إصدار تجريبي محدود. عندما تكون مستعدًا للبيع عبر الإنترنت وقبول الدفع لموقعك ، قم بالترقية إلى إحدى حزم Premium للأعمال والتجارة الإلكترونية الخاصة بنا.
                </Panel>
                <Panel header="هل تحتاج مواقع التجارة الإلكترونية إلى رخصة تجارية؟" key="14">
                    لكل بلد أو منطقة قوانين ولوائح مختلفة فيما يتعلق بتراخيص أعمال التجارة الإلكترونية. لبيع منتجاتك عبر الإنترنت ، تأكد من الامتثال لقوانين وأنظمة التجارة الإلكترونية المحلية. من الجيد دائمًا استشارة محامٍ أولاً قبل إنشاء موقع للتجارة الإلكترونية.
                </Panel>
            </Collapse>
        </QuestionStyle>
    );
}
