import FlexDiv from "components/utils/flex-div";
import { Divider, Typography } from 'antd';
import Container from "components/utils/container";
const { Title, Paragraph } = Typography;

export default function HelpView() {
    return (
        <Container style={{ padding: "100px 0 0 0" }}>
            <FlexDiv justifyContent="center" as="h1">سياسة خصوصية متجر Applighterz</FlexDiv>
            <Typography>
                <Title style={{ fontSize: 20 }} level={2}>طرق الدفع :</Title>

                <Paragraph>
                    <ul>
                        <li>
                            - طريقة الدفع المتوفرة هي الدفع نقدا عند الاستلام
                        </li>
                        <li>
                            - يحق للزبون فحص المنتج والتأكد منه قبل الدفع
                        </li>
                        <li>
                            - تظهر طريقة الدفع عند الاستلام في صفحة اتمام الطلب.
                        </li>
                        <li>
                            - عند اتمام الطلب, يتم التواصل مع الزبون خلال مدة اقصاها 3 ايام وفي حال الفشل في التواصل مع الزبون هاتفيا لمدة تزيد عن 3 ايام يتم الغاء الطلب تلقائيا.
                        </li>
                        <li>
                            - يتم الدفع نقدا بعملة ال شيكل كما هو مبين في صفحة اتمام الطلب.
                        </li>
                    </ul>
                </Paragraph>
                <Title style={{ fontSize: 20 }} level={2}>سياسة التبديل :</Title>
                <Paragraph>
                    <ul>
                        <li>
                            - يرجى التأكد من الاحتفاظ بفاتورة المنتج المستلم المرفقة بالطرد لأهميتها الكبيرة في اتمام عملية التبديل بالشكل السليم ولأهمية المعلومات المرفقة بها كرقم الطرد و كود المنتج.
                        </li>
                        <li>
                            - يرفع طلب التبديل خلال مدة لا تزيد عن 24 ساعة من استلام الطرد حيث ان هذه المدة كافية للزبون من التحقق والتأكد من المنتج الذي استلمه.
                        </li>
                        <li>
                            - يرفع طلب التبديل من خلال التواصل مع صاحب المتجر واتس اب او من خلال خدمة الدعم (( الموقع والتطبيق حيث يتم تزويد موظف الخدمات برقم الهاتف الخاص بالزبون ورقم الطلب الواضح على الفاتورة المرفقة بالطلب الذي يرغب بتبديله )).
                        </li>
                        <li>
                            - رسوم التبديل 10 شيكل لمناطق الضفة الغربية و 20 شيكل لمناطق القدس و 35 شيكل للمناطق 48 وهي رسوم رمزية لتغطية جزء من تكلفة التوصيل للمرة الثانية.**
                        </li>
                        <li>
                            - التبديل مجاني في حال تبين خلل في المنتج لم يظهر اثناء الاستلام وعند تأكد الزبون من الطرد الذي استلمه وهنا نؤكد للزبون ضرورة التأكد من المنتج بوجود موظف التوصيل كالقياس وغيرها لتجنب التبديل فيما بعد ومعالجة الخلل مباشرة من خلال موظف التوصيل.
                        </li>
                        <li>
                            - يسمح بتبديل المنتج بمنتج اخر بنفس السعر غير شامل رسوم التوصيل في  ألمره الاولى ان وجدت أو بمنتج اخر بسعر اعلى فقط مع دفع فرقية السعر ورسوم التبديل.
                        </li>
                        <li>
                            - لا يتم قبول طلب التبديل في حال اتلاف الزبون لكرتونة المنتج او غلافه وايضا في حال كان المنتج مستعملا ويجب ان يكون المنتج كاملا وغير منتقص. وهنا نؤكد حرصنا على خدمة الزبون بالشكل الأمثل.
                        </li>
                        <li>
                            - التبديل متاح لكل المنتجات المتوفرة في الموقع باستثناء(( العطور و الملابس الداخلية و الالكترونيات )).
                        </li>
                    </ul>
                </Paragraph>
                <Title style={{ fontSize: 20 }} level={2}>طرق التوصيل  :</Title>
                <Paragraph>
                    <ul>
                        <li>
                            - يتم توصيل المنتجات خلال خدمة التوصيل الخاصة في شركة مارت.
                        </li>
                        <li>
                            - يتم التوصيل الى كل مدن وقرى الضفة الغربية  القدس.
                        </li>
                        <li>
                            -  رسوم التوصيل في الضفة الغربية: 10 شيكل اذا كان مجموع كامل طلباتك اقل من 150 شيكل ويكون التوصيلمجاني للطلبات بقيمة 150 شيكل واكثر
                        </li>
                        <li>
                            - رسوم التبديل 10 شيكل لمناطق الضفة الغربية و 20 شيكل لمناطق القدس و 35 شيكل للمناطق 48 وهي رسوم رمزية لتغطية جزء من تكلفة التوصيل للمرة الثانية.**
                        </li>
                        <li>
                            -  رسوم التوصيل في القدس: 20 شيكل.
                        </li>
                        <li>
                            - رسوم التوصيل في مناطق 48: 35 شيكل
                        </li>
                        <li>
                            - تنطبق اليات ورسوم التوصيل على كل المنتجات الظاهرة في الموقع. **
                        </li>

                    </ul>
                </Paragraph>
                <Title style={{ fontSize: 20 }} level={2}>سياسة الخصوصيه   :</Title>
                <Paragraph>
                    هذه الشروط وضعت لتخدم من هم مهتمين بكيف تقوم شركة مارت باستخدام معلوماتهم الشخصية على الانترنت, كما هي موضحة حسب القوانين الدولية لشروط الخصوصية وامن المعلومات. والمعلومات التي يمكن استخدامها بمفردها أو مع غيرها من المعلومات للتعرف على معلومات الاتصال، أو تحديد موقع شخص معين. يرجى قراءة سياسة الخصوصية بعناية للحصول على فهم واضح لكيفية جمع واستخدام وحماية أو التعامل مع المعلومات المعرفة بهويتك الشخصية وفقا لموقعنا على شبكة الإنترنت. .

                    لمتابعة قراءة شروط الخصوصية اضغط على الرابط :هنا

                </Paragraph>
            </Typography>
        </Container>
    );
}
